# Encoding - 문자형 변수 -> 숫자형 변수

In [1]:
import seaborn as sns
DF = sns.load_dataset('mpg')

In [2]:
DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    object
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

In [3]:
DF.head()

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst
4  17.0          8         302.0  ...          70     usa                ford torino

[5 rows x 9 columns]

### 문자형 데이터 : 'origin'

In [4]:
type(DF.origin[0])

str

### 명목형 : 이름확인 및 빈도분석

In [6]:
DF.origin.value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64

### 'origin' Data

In [7]:
x = DF[['origin']]

In [8]:
x[111:115]

     origin
111   japan
112     usa
113     usa
114  europe

## 2) with LabelEncoder

### 정수(integer) 인코딩

In [9]:
from sklearn.preprocessing import LabelEncoder

encoder1=LabelEncoder()
LE = encoder1.fit_transform(x)

/usr/local/lib/python3.7/dist-packages/sklearn/preprocessing/_label.py:251: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

### 정수 인코딩 결과

In [10]:
LE[111:115]

array([1, 2, 2, 0])

## 3) with OneHotEncoder

### 원-핫(One-Hot) 인코딩

In [11]:
from sklearn.preprocessing import OneHotEncoder

encoder2 = OneHotEncoder()
OHE=encoder2.fit_transform(x)

### Array 변환 필요

In [12]:
# 주소형태로 알려주는, 튜플에 첫번째는 순서, 두번째는 주소/ 보기 어려우니까, 밑에 to array로
print(OHE[111:115])

  (0, 1)	1.0
  (1, 2)	1.0
  (2, 2)	1.0
  (3, 0)	1.0

In [13]:
OHE.toarray()[111:115]

array([[0., 1., 0.],
       [0., 0., 1.],
       [0., 0., 1.],
       [1., 0., 0.]])